{
  "backend/main.mo": "Main actor for the Kodinar Bazaar ICP backend, defining data types and state for users, products, carts, and orders, with functions for user profiles, product management, cart operations, order placement, and Stripe checkout integration.",
  "backend/migration.mo": "Data migration module that converts legacy orders with text-based status fields and no Stripe payment intent ID to the new order schema with variant status types and an optional stripePaymentIntentId field.",
  "feature_evidence.json": "Feature evidence report mapping the Stripe checkout payment flow feature to its relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing the purpose of each component, page, hook, and config file in the project.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for the light and dark theme color tokens used throughout the shadcn/ui component system.",
  "frontend/index.html": "Minimal HTML entry point for the Kodinar Bazaar React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, renders the Layout with Header, Footer, ProfileSetupModal, and StripeSetupModal, and includes routes for payment success and failure pages.",
  "frontend/src/components/AccessDenied.tsx": "Reusable access denied UI component displaying a shield icon, a configurable message, and a button to navigate back to the home page.",
  "frontend/src/components/CartIcon.tsx": "Header cart icon button that shows a live item count badge by fetching the current user's cart, only displaying the count when the user is authenticated.",
  "frontend/src/components/Header.tsx": "Sticky app header with the Kodinar Bazaar logo, desktop and mobile navigation links, user profile display with role badge, cart icon, and login/logout button.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, handling login, logout, and loading states with appropriate styling.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, category badge, price, stock info, and an add-to-cart button that requires authentication.",
  "frontend/src/components/ProductForm.tsx": "A reusable form component for creating or editing a product, supporting image upload with progress tracking, and fields for name, description, price, category, and stock.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to set up their profile with a name, contact, and role (buyer or seller).",
  "frontend/src/components/StripeSetupModal.tsx": "A modal dialog for sellers to configure Stripe payments by entering a secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, products, cart operations, orders, and Stripe checkout sessions using the ICP actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Google Fonts (Playfair Display and Inter), and defines a warm marketplace color palette (saffron, turmeric, terracotta) as CSS custom properties for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details, supports quantity adjustments and removal, and handles checkout via either Stripe or direct order confirmation.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero banner, featured product categories, and local marketplace value propositions with navigation to products and seller dashboard.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that fetches and displays order status (paid, pending, or failed) with appropriate icons and messaging after checkout.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static payment failure/cancellation page that informs the user no charges were made and provides options to retry checkout or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment result page that reads a Stripe session_id from the URL, polls its status, and shows success, failure, or generic order-placed UI accordingly.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders a single product's detail view with image, price, stock, quantity selector, and add-to-cart/buy-now actions, requiring authentication for cart operations.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with client-side filtering by search query and category, featuring a sidebar category list and a responsive filter toggle for mobile.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller-only dashboard that lets authenticated sellers add, edit, delete, and mark products as out-of-stock via dialogs and a product table.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and remove sensitive params from the URL without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, an Indian-market-themed color palette (saffron, turmeric, terracotta, cream), warm box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of a Kodinar-focused e-commerce app project, including schema version, architectural notes, known issues, and a list of existing implemented features with their requirement IDs and versions."
}