{
  "backend/main.mo": "Main actor for the Kodinar Bazaar backend, defining data types (Product, Order, UserProfile, CartItem) and implementing user profile management, product CRUD, cart operations, order handling, and Stripe payment integration with access control.",
  "backend/migration.mo": "Data migration module that converts the old actor state (with text-based product categories) to the new state (with typed Category enum variants), mapping string category values to their corresponding enum types.",
  "feature_evidence.json": "Feature evidence report documenting the addition of 'Sea Foods' to the category filter sidebar and ProductForm dropdown, listing the affected frontend files and associated test ID REQ-12.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, page, hook, and config file's purpose and notable implementation details including the seafood category additions.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Kodinar Bazaar React app, mounting the root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, renders the Layout with Header/Footer, and conditionally shows ProfileSetupModal and StripeSetupModal based on auth and admin state.",
  "frontend/src/components/AccessDenied.tsx": "Reusable access denied UI component displaying a shield icon, a configurable message, and a home navigation button styled with terracotta/saffron theme colors.",
  "frontend/src/components/CartIcon.tsx": "Header cart icon button that displays a live item count badge fetched from the cart query, showing counts only when the user is authenticated.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, navigation links (Browse, My Shop for sellers), user profile badge, cart icon, and a responsive mobile menu.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login/logout, showing loading state during authentication and toggling between login and logout actions.",
  "frontend/src/components/ProductCard.tsx": "Card UI for a single product displaying its image, category badge, name, price, stock, and an Add to Cart button with out-of-stock handling.",
  "frontend/src/components/ProductForm.tsx": "Reusable form for creating or editing a product, handling image upload with progress tracking, and collecting name, description, price, category, and stock fields.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to new users to collect their name, contact, and role (buyer or seller) and save the profile via a mutation hook.",
  "frontend/src/components/StripeSetupModal.tsx": "Modal dialog for sellers to configure Stripe payments by entering a secret key and allowed countries, with validation and success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to manage login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, products, cart operations, orders, and Stripe checkout sessions.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines a warm marketplace color palette (saffron, turmeric, terracotta) with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, calculates subtotals, and handles checkout by placing an order and optionally redirecting to a Stripe payment session.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero banner, featured product categories, and key marketplace features promoting the local Kodinar Bazaar with navigation to products and seller dashboard.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that fetches and displays an order's status (paid, pending, or failed) with appropriate icons and messaging after checkout.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation/failure page with an explanation and action buttons to retry (go to cart), continue shopping, or go home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success page that verifies the Stripe session status via a query hook and shows loading, success, or failure states accordingly.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows a detailed view of a single product including image, stock, quantity selector, and add-to-cart/buy-now actions, with loading and error states.",
  "frontend/src/pages/ProductsPage.tsx": "Renders a browsable product listing page with search input and category filter sidebar, filtering products client-side from a full product list query.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Provides a seller-only dashboard for managing their products, including add, edit, delete, and mark-out-of-stock actions with role-based access control.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters (supporting both regular and hash-based routing), persisting them in sessionStorage, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom colors (saffron, turmeric, terracotta, cream), fonts (Playfair Display, Inter), shadows, border radii, and accordion animations, using typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 7) for a Kodinar local e-commerce app, listing existing implemented features such as product browsing, product detail, shopping cart, seller dashboard, user registration, and visual theming."
}