{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 'Sea Foods' as a product category",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add 'Sea Foods' to the category filter list on ProductsPage and to the category dropdown in ProductForm so sellers can select it and buyers can filter by it",
      "acceptanceCriteria": [
        "'Sea Foods' appears as a selectable option in the category dropdown inside ProductForm (Seller Dashboard).",
        "'Sea Foods' appears as a filter option in the category sidebar on ProductsPage.",
        "Filtering by 'Sea Foods' correctly shows only products assigned that category.",
        "The category badge on product cards displays 'Sea Foods' when that category is assigned."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductForm.tsx",
          "operation": "modify",
          "description": "Add 'Sea Foods' as a selectable option in the category dropdown select element. Map the display label 'Sea Foods' to the backend Category.seafood enum value. Ensure the mapping is consistent with existing category options (e.g., 'Baked Goods' maps to bakedGoods)."
        },
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Add 'Sea Foods' to the category filter sidebar list. Ensure clicking the 'Sea Foods' filter correctly updates the selectedCategory state to filter products by Category.seafood. Maintain consistency with existing category filter button styling and behavior."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Update the category badge display logic to show 'Sea Foods' as the human-readable label when product.category is Category.seafood. Ensure the category label transformation is consistent with other categories (e.g., bakedGoods displays as 'Baked Goods')."
        }
      ]
    }
  ]
}